Incompressible/NACA0012_StructuredMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontandback
    {
        type            empty;
        physicalType    empty;
        nFaces          259160;
        startFace       258240;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          1045;
        startFace       517400;
    }
    airfoil
    {
        type            patch;
        physicalType    patch;
        nFaces          547;
        startFace       518445;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          248;
        startFace       518992;
    }
)

// ************************************************************************* //
