Incompressible/NACA0012_StructuredMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{	
    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-07;
        relTol          0.1;
    }

    p
    {
        $Phi;
    }

    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    residualControl
    {
        p               	    1e-5;
        U               	    1e-5;
        "(k|epsilon|omega)"        1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               	     0.7;
        "(k|epsilon|omega)"         0.7;
    }
}



PISO
{
    nCorrectors     2; // Quantas vezes vai corrigir a pressão: U -> p -> U -> p ... >= 2
    nNonOrthogonalCorrectors 2; // Quantas vezes vai corrigir o cálculo da pressão na célula, sabendo que esta não é ortogonal (nonOrthogonal)
    pRefCell        0;
    pRefValue       0;
}

potentialFlow
{
    PhiRefCell 77;
    PhiRefValue 0;
    nNonOrthogonalCorrectors 10;
}


// ************************************************************************* //
